In [2]:
pip install pymysql

Collecting pymysql
  Obtaining dependency information for pymysql from https://files.pythonhosted.org/packages/0c/94/e4181a1f6286f545507528c78016e00065ea913276888db2262507693ce5/PyMySQL-1.1.1-py3-none-any.whl.metadata
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ---------------------------------------- 0.0/45.0 kB ? eta -:--:--
   --------------------------- ------------ 30.7/45.0 kB 660.6 kB/s eta 0:00:01
   ---------------------------------------- 45.0/45.0 kB 739.0 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1
Note: you may need to restart the kernel to use updated packages.

In [7]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql 
username = "root"
password="1234"
host = "localhost"
database = "harini17"
connection_string = f'mysql+pymysql://{username}:{password}@{host}/{database}'
engine = create_engine(connection_string)

df_sql = pd.read_sql('SELECT * FROM details', engine)
path= r"C:\22b81a1218\1-02-25\dummy_data.xlsx"
df2_excel = pd.read_excel(path)
merged_df = pd.merge(df_sql,df2_excel,on='Sno',how='outer')
# merge =  pd.merge(df_sql,df2_excel,on='Sno',how='outer')
# print(merge)
print(merged_df)

    Sno     Sname  marks     city    mobile  gender  Course Grade  Age  \
0     1    HARINI     90      HYD  90343479  female  B.Tech     B   18
1     2    HASINI     95      BAN  90343479  female  M.Tech     C   19
2     3     SANIA     98     CHEN  90343779  female     MBA     C   22
3     4      TINA     80      GOA  98343779  female     MBA     D   19
4     5     ARUSH     82   PUNJAB  98348779    male     MBA     B   23
5     6   BHARGAV     84     PUNE  92218729    male     MBA     A   19
6     7  YASHASVI     86   KERALA  92238729    male  M.Tech     D   19
7     8   SAITEJA     88    DELHI  92238929    male  M.Tech     C   18
8     9   DHANUSH     89       UP  92248929    male     MBA     C   18
9    10    SATWIK     83       MP  92248929    male    B.Sc     C   22
10   11   DHEERAJ     85  KASHMIR  92288929    male    B.Sc     A   20

                 Email
0    user1@example.com
1    user2@example.com
2    user3@example.com
3    user4@example.com
4    user5@example.com
5    user6@example.com
6    user7@example.com
7    user8@example.com
8    user9@example.com
9   user10@example.com
10  user11@example.com

In [8]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sno     11 non-null     int64
 1   Sname   11 non-null     object
 2   marks   11 non-null     int64
 3   city    11 non-null     object
 4   mobile  11 non-null     int64
 5   gender  11 non-null     object
 6   Course  11 non-null     object
 7   Grade   11 non-null     object
 8   Age     11 non-null     int64
 9   Email   11 non-null     object
dtypes: int64(4), object(6)
memory usage: 1012.0+ bytes

In [10]:
import numpy as np
merged_df['Sno'] = merged_df['Sno'].astype(np.int16)

In [11]:
merged_df['Sno'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 11 entries, 0 to 10
Series name: Sno
Non-Null Count  Dtype
--------------  -----
11 non-null     int16
dtypes: int16(1)
memory usage: 154.0 bytes

In [12]:
merged_df['marks'] = merged_df['marks'].astype(np.int16)

In [13]:
merged_df['Age'] = merged_df['Age'].astype(np.int16)

In [14]:
merged_df.memory_usage(deep=True)

Index     132
Sno        22
Sname     695
marks      22
city      672
mobile     88
gender    679
Course    674
Grade     638
Age        22
Email     816
dtype: int64

In [16]:
merged_df.memory_usage()

Index     132
Sno        22
Sname      88
marks      22
city       88
mobile     88
gender     88
Course     88
Grade      88
Age        22
Email      88
dtype: int64

In [15]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sno     11 non-null     int16
 1   Sname   11 non-null     object
 2   marks   11 non-null     int16
 3   city    11 non-null     object
 4   mobile  11 non-null     int64
 5   gender  11 non-null     object
 6   Course  11 non-null     object
 7   Grade   11 non-null     object
 8   Age     11 non-null     int16
 9   Email   11 non-null     object
dtypes: int16(3), int64(1), object(6)
memory usage: 814.0+ bytes

In [19]:
merged_df['city'] = merged_df['city'].astype('category')

In [20]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sno     11 non-null     int16
 1   Sname   11 non-null     object
 2   marks   11 non-null     int16
 3   city    11 non-null     category
 4   mobile  11 non-null     int64
 5   gender  11 non-null     object
 6   Course  11 non-null     object
 7   Grade   11 non-null     object
 8   Age     11 non-null     int16
 9   Email   11 non-null     object
dtypes: category(1), int16(3), int64(1), object(5)
memory usage: 1.1+ KB